<a href="https://colab.research.google.com/github/codingjobrice/Machine-Learning/blob/main/1_4_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# pandas
# 2차원 데이터를 효율적으로 처리할 수 있는 기능을 제공함

# 용어

# index : 개별 데이터를 고유하게 식별하는 key 값
# series : 칼럼이 하나뿐인 데이터 구조체
# DataFrame : 칼럼이 여러 개인 데이터 구조체 (DataFrame은 여러개의 series로 구성)

# 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

import pandas as pd

# colab 환경에서 파일 불러오기
from google.colab import drive
from google.colab import files

drive.mount('/mlData')
files.upload()

titanic_df=pd.read_csv('titanic_train.csv')

Mounted at /mlData

Saving titanic_train.csv to titanic_train.csv

In [ ]:
# read_csv() 는 별다른 파라미터 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 변환한다.

print('titanic 변수 type:',type(titanic_df))
titanic_df

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# 맨 앞 3개의 로우 반환
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
# 행, 열 크기 알아보기
print('DataFrame 크기: ',titanic_df.shape)
# 891의 row 와 12개의 column으로 이루어짐

DataFrame 크기:  (891, 12)

In [ ]:
# info() : 데이터 건수, 데이터 타입, Null 건수를 알 수 있다.
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# describe : 칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값을 나타낸다. object 타입의 칼럼은 출력에서 제외한다.
titanic_df.describe()
# count : Not Null인 데이터 건수
# mean : 전체 데이터의 평균값
# std : 표준 편차
# min, max : 최솟값, 최댓값

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
# value_counts : 칼럼의 데이터값 건수를 반환
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
# series : Index와 단 하나의 칼럼으로 구성된 데이터 세트
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))
titanic_pclass.head()

<class 'pandas.core.series.Series'>

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [ ]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

In [4]:
# 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기
import numpy as np

# 1차원
col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)
print('array1 shape:',array1.shape)

# 리스트를 이용해 DataFrame 생성
df_list1=pd.DataFrame(list1,columns=col_name1)
print("1차원 리스트로 만든 DataFrame 생성\n",df_list1)

# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1=pd.DataFrame(array1,columns=col_name1)
print("1차원 ndarray로 만든 DataFramne 생성\n",df_array1)

array1 shape: (3,)
1차원 리스트로 만든 DataFrame 생성
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFramne 생성
    col1
0     1
1     2
2     3

In [6]:
# 2차원
col_name2=['col1','col2','col3']

# 2행 3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2=[[1,2,3],[11,12,13]]
array2=np.array(list2)
print("array2 shape:",array2.shape)

# 리스트로 DataFrame 생성
df_list2=pd.DataFrame(list2,columns=col_name2)
print("2차원 리스트로 만든 DataFrame 생성\n",df_list2)

# ndarray로 DataFrame 생성
df_array2=pd.DataFrame(list2,columns=col_name2)
print("2차원 ndarray로 만든 DataFramne 생성\n",df_array2)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame 생성
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFramne 생성
    col1  col2  col3
0     1     2     3
1    11    12    13

In [7]:
# 딕셔너리를 DataFrame으로 변환
# 키는 칼럼명, 값은 키에 해당한느 칼럼 데이터로 변환

dict={'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict=pd.DataFrame(dict)
print("딕셔너리로 만든 DataFrame\n",df_dict)

딕셔너리로 만든 DataFrame
    col1  col2  col3
0     1     2     3
1    11    22    33

In [9]:
# DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

# DataFrame을 ndarray로 변환
array3=df_dict.values
print("df_dict.values 타입:",type(array3),'df_dict.values shape:',array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [10]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print("df_dict.values.tolist() 타입:",type(list3))
print(list3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

In [12]:
# DataFrame을 딕셔너리로 변환
dict3=df_dict.to_dict('list')
print("df_dict.to_dict() 타입:",type(dict3))
print(dict3)

df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}